#    -*- mode: org -*-


Archived entries from file /home/thanawat/.my-emacs.d/config.org


* Experiment
:PROPERTIES:
:ARCHIVE_TIME: 2022-04-13 Wed 17:47
:ARCHIVE_FILE: ~/.my-emacs.d/config.org
:ARCHIVE_OLPATH: Meow/Define keys
:ARCHIVE_CATEGORY: config
:END:
#+header: :var normal-keybindings=normal-keybindings :var motion-keybindings=motion-keybindings :var leader-keybindings=leader-keybindings
#+begin_src emacs-lisp :tangle nil
  (setq  parse-def  (lambda (x)
			  (cons (format "%s" (car x))
				  (if (string-prefix-p "dispatch:" (cadr x))
				      (string-trim (substring (cadr x) 9))
				  (intern (cadr x))))))
  (message "keybinds %s" motion-keybindings)

#+end_src

#+RESULTS:
: keybinds ((<escape> ignore) (1 select-window-1) (2 select-window-2) (3 select-window-3) (4 select-window-4) (5 select-window-5) (6 select-window-6) (7 select-window-7) (8 select-window-8) (9 select-window-9) (0 select-window-0))
